; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_3 type_2)
 (:predicates (pred_3 ?v6 - type_3 ?v8 - type_1)
 	      (pred_1 ?v3 - object ?v8 - type_1)
	      (pred_4 ?v6 - type_3 ?v1 - type_2)
	      (pred_2 ?v6 - type_3 ?v3 - object ?v1 - type_2))

   (:action op_2
       :parameters  (?v6 - type_3 ?v2 ?v5 - type_1)
       :precondition (and  (pred_3 ?v6 ?v2))
       :effect (and  (pred_3 ?v6 ?v5)
		     (not (pred_3 ?v6 ?v2))))

   (:action op_1
       :parameters (?v6 - type_3 ?v4 - object ?v7 - type_1 ?v1 - type_2)
       :precondition  (and  (pred_1 ?v4 ?v7) (pred_3 ?v6 ?v7) (pred_4 ?v6 ?v1))
       :effect (and (pred_2 ?v6 ?v4 ?v1)
		    (not (pred_1 ?v4 ?v7)) 
		    (not (pred_4 ?v6 ?v1))))

   (:action op_3
       :parameters (?v6 - type_3 ?v4 - object ?v7 - type_1 ?v1 - type_2)
       :precondition  (and  (pred_2 ?v6 ?v4 ?v1) (pred_3 ?v6 ?v7))
       :effect (and (pred_1 ?v4 ?v7)
		    (pred_4 ?v6 ?v1)
		    (not (pred_2 ?v6 ?v4 ?v1)))))

; problem
(define (problem gripper-1-3-3)
(:domain gripper-strips)
(:objects obj_02 - type_3
obj_05 obj_03 - type_2
obj_04 obj_01 obj_07 - type_1
obj_08 obj_06 obj_09 - object)
(:init
(pred_3 obj_02 obj_01)
(pred_4 obj_02 obj_05)
(pred_4 obj_02 obj_03)
(pred_1 obj_08 obj_01)
(pred_1 obj_06 obj_01)
(pred_1 obj_09 obj_04)
)
(:goal
(and
(pred_1 obj_08 obj_01)
(pred_1 obj_06 obj_04)
(pred_1 obj_09 obj_07)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_2 obj_02 ?b obj_03))))
)
)

; plan
1. (op_1 obj_02 obj_06 obj_01 obj_05)
   deleted: (pred_1 obj_06 obj_01) (pred_4 obj_02 obj_05)
   added: (pred_2 obj_02 obj_06 obj_05)
   goals met: 1 of 3
2. (op_2 obj_02 obj_01 obj_04)
   deleted: (pred_3 obj_02 obj_01)
   added: (pred_3 obj_02 obj_04)
   goals met: 1 of 3
3. (op_3 obj_02 obj_06 obj_04 obj_05)
   deleted: (pred_2 obj_02 obj_06 obj_05)
   added: (pred_1 obj_06 obj_04) (pred_4 obj_02 obj_05)
   goals met: 2 of 3
4. (op_1 obj_02 obj_09 obj_04 obj_05)
   deleted: (pred_1 obj_09 obj_04) (pred_4 obj_02 obj_05)
   added: (pred_2 obj_02 obj_09 obj_05)
   goals met: 2 of 3
5. (op_2 obj_02 obj_04 obj_07)
   deleted: (pred_3 obj_02 obj_04)
   added: (pred_3 obj_02 obj_07)
   goals met: 2 of 3
6. (op_3 obj_02 obj_09 obj_07 obj_05)
   deleted: (pred_2 obj_02 obj_09 obj_05)
   added: (pred_1 obj_09 obj_07) (pred_4 obj_02 obj_05)
   goals met: 3 of 3
